# Exercises - Classification

**The end product of this exercise is a jupyter notebook (**
`classification_exercises.ipynb`
**) and** 
`acquire.py`
**. The notebook will contain all your work as you move through the exercises. The** 
`acquire.py` 
**file should contain the final functions.**

In [1]:
import numpy as np
import pandas as pd

import acquire as acq

from debug import local_settings, timeifdebug, timeargsifdebug, frame_splain

In [2]:
local_settings['DEBUG']=True

In [3]:
local_settings['SPLAIN']=1

In [4]:
local_settings

{'DEBUG': True,
 'ARGS': False,
 'KWARGS': False,
 'SPLAIN': 1,
 'TOPX': 5,
 'MAXCOLS': 10}

### In a jupyter notebook, `classification_exercises.ipynb`:

1. **Use a python module containing datasets as a source from the** 
`iris` 
**data. Create a pandas dataframe,** 
`df_iris`
**, from this data.**

In [5]:
df_iris = pd.read_csv('iris.csv')

  - print the first 3 rows

In [6]:
df_iris.head(3)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

  - print the number of rows and columns (shape)

In [7]:
df_iris.shape

(150, 5)

  - print the column names

In [8]:
frame_splain(df_iris, 'df_iris', splain=1)

DF_IRIS SHAPE:
(150, 5)

DF_IRIS INFO:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
sepal_length    150 non-null float64
sepal_width     150 non-null float64
petal_length    150 non-null float64
petal_width     150 non-null float64
species         150 non-null object
dtypes: float64(4), object(1)
memory usage: 5.9+ KB
None

DF_IRIS DESCRIPTION:
              count      mean       std  min  25%   50%  75%  max
sepal_length  150.0  5.843333  0.828066  4.3  5.1  5.80  6.4  7.9
sepal_width   150.0  3.057333  0.435866  2.0  2.8  3.00  3.3  4.4
petal_length  150.0  3.758000  1.765298  1.0  1.6  4.35  5.1  6.9
petal_width   150.0  1.199333  0.762238  0.1  0.3  1.30  1.8  2.5

DF_IRIS HEAD:
   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

  - print the data type of each column

In [9]:
df_iris.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

   - print the summary statistics for each of the numeric variables. Would you recommend rescaling the data based on these statistics?

In [10]:
df_iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

2. **Read** 
`Table1_CustDetails` 
**the excel module dataset,** 
`Excel_Exercises.xlsx`
**, into a dataframe,** 
`df_excel`
**.**

In [11]:
df_excel = acq.excel_df('Excel_Exercises.xlsx', splain=1)

starting excel_df
starting df_df
DATAFRAME SHAPE:
(7049, 12)

DATAFRAME INFO:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7049 entries, 0 to 7048
Data columns (total 12 columns):
customer_id          7049 non-null object
gender               7049 non-null object
is_senior_citizen    7049 non-null int64
partner              7049 non-null object
dependents           7049 non-null object
phone_service        7049 non-null int64
internet_service     7049 non-null int64
contract_type        7049 non-null int64
payment_type         7049 non-null object
monthly_charges      7049 non-null float64
total_charges        7038 non-null float64
churn                7049 non-null object
dtypes: float64(2), int64(4), object(6)
memory usage: 660.9+ KB
None

DATAFRAME DESCRIPTION:
                    count         mean          std    min       25%      50%  \
is_senior_citizen  7049.0     0.162009     0.368485   0.00    0.0000     0.00
phone_service      7049.0     1.324585     0.642709   0.00    1.0000     1.00
internet_service   7049.0     1.222585     0.779068   0.00    1.0000     1.00
contract_type      7049.0     0.690878     0.833757   0.00    0.0000     0.00
monthly_charges    7049.0    64.747014    30.099460  18.25   35.4500    70.35
total_charges      7038.0  2283.043883  2266.521984  18.80  401.5875  1397.10

                        75%      max
is_senior_citizen     0.000     1.00
phone_service         2.000     2.00
internet_service      2.000     2.00
contract_type         1.000     2.00
monthly_charges      89.850   118.75
total_charges      3793.775  8684.80

ending df_df ; time: 0.02788090705871582
ending excel_df ; time: 2.162506103515625

  - assign the first 100 rows to a new dataframe, `df_excel_sample`.

In [12]:
df_excel_sample = acq.df_df(df_excel.head(100), splain=1)

starting df_df
DATAFRAME SHAPE:
(100, 12)

DATAFRAME INFO:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 12 columns):
customer_id          100 non-null object
gender               100 non-null object
is_senior_citizen    100 non-null int64
partner              100 non-null object
dependents           100 non-null object
phone_service        100 non-null int64
internet_service     100 non-null int64
contract_type        100 non-null int64
payment_type         100 non-null object
monthly_charges      100 non-null float64
total_charges        100 non-null float64
churn                100 non-null object
dtypes: float64(2), int64(4), object(6)
memory usage: 9.5+ KB
None

DATAFRAME DESCRIPTION:
                   count       mean          std    min       25%       50%  \
is_senior_citizen  100.0     0.1900     0.394277   0.00    0.0000     0.000
phone_service      100.0     1.3300     0.667499   0.00    1.0000     1.000
internet_service   100.0     1.3000     0.771984   0.00    1.0000     1.000
contract_type      100.0     0.6600     0.819214   0.00    0.0000     0.000
monthly_charges    100.0    68.9670    31.230825  19.40   44.8250    75.300
total_charges      100.0  2481.9295  2434.628234  19.85  525.1625  1559.175

                         75%     max
is_senior_citizen     0.0000     1.0
phone_service         2.0000     2.0
internet_service      2.0000     2.0
contract_type         1.0000     2.0
monthly_charges      94.3125   116.8
total_charges      3712.8750  8496.7

ending df_df ; time: 0.04958009719848633

  - print the number of rows of your original dataframe

In [13]:
df_excel.shape[0]

7049

  - print the first 5 column names

In [14]:
df_excel.columns[:5]

Index(['customer_id', 'gender', 'is_senior_citizen', 'partner', 'dependents'], dtype='object')

  - print the column names that have a data type of object

In [15]:
print(df_excel.dtypes)
print(df_excel.columns[df_excel.dtypes=='object'])

customer_id           object
gender                object
is_senior_citizen      int64
partner               object
dependents            object
phone_service          int64
internet_service       int64
contract_type          int64
payment_type          object
monthly_charges      float64
total_charges        float64
churn                 object
dtype: object
Index(['customer_id', 'gender', 'partner', 'dependents', 'payment_type',
       'churn'],
      dtype='object')

  - compute the range for each of the numeric variables.

In [16]:
df_excel.describe()

,is_senior_citizen,phone_service,internet_service,contract_type,monthly_charges,total_charges
count,7049.000000,7049.000000,7049.000000,7049.000000,7049.000000,7038.000000
mean,0.162009,1.324585,1.222585,0.690878,64.747014,2283.043883
std,0.368485,0.642709,0.779068,0.833757,30.099460,2266.521984
min,0.000000,0.000000,0.000000,0.000000,18.250000,18.800000
25%,0.000000,1.000000,1.000000,0.000000,35.450000,401.587500
50%,0.000000,1.000000,1.000000,0.000000,70.350000,1397.100000
75%,0.000000,2.000000,2.000000,1.000000,89.850000,3793.775000
max,1.000000,2.000000,2.000000,2.000000,118.750000,8684.800000

3. **Read the data from [this google sheet](https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit?usp=sharing) into a dataframe,** `df_google`
**.**

In [17]:
google_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'
df_google = acq.google_df(google_url, splain=1)

starting google_df
starting df_df
DATAFRAME SHAPE:
(891, 12)

DATAFRAME INFO:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB
None

DATAFRAME DESCRIPTION:
             count        mean         std   min       25%       50%    75%  \
PassengerId  891.0  446.000000  257.353842  1.00  223.5000  446.0000  668.5
Survived     891.0    0.383838    0.486592  0.00    0.0000    0.0000    1.0
Pclass       891.0    2.308642    0.836071  1.00    2.0000    3.0000    3.0
Age          714.0   29.699118   14.526497  0.42   20.1250   28.0000   38.0
SibSp        891.0    0.523008    1.102743  0.00    0.0000    0.0000    1.0
Parch        891.0    0.381594    0.806057  0.00    0.0000    0.0000    0.0
Fare         891.0   32.204208   49.693429  0.00    7.9104   14.4542   31.0

                  max
PassengerId  891.0000
Survived       1.0000
Pclass         3.0000
Age           80.0000
SibSp          8.0000
Parch          6.0000
Fare         512.3292

ending df_df ; time: 0.025095701217651367
ending google_df ; time: 0.3916330337524414

  - print the first 3 rows

In [18]:
df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

  - print the number of rows and columns

In [19]:
df_google.shape

(891, 12)

  - print the column names

In [20]:
df_google.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

  - print the data type of each column

In [21]:
df_google.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

  - print the summary statistics for each of the numeric variables

In [22]:
df_google.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

  - print the unique values for each of your categorical variables

In [23]:
for col in df_google:
    if df_google[col].dtype=='O':
        print(df_google[col].value_counts()[:])
        print()

Peuchen, Major. Arthur Godfrey                           1
Baxter, Mr. Quigg Edmond                                 1
Sutton, Mr. Frederick                                    1
Palsson, Mrs. Nils (Alma Cornelia Berglund)              1
Troupiansky, Mr. Moses Aaron                             1
Turkula, Mrs. (Hedwig)                                   1
Sjostedt, Mr. Ernst Adolf                                1
Gustafsson, Mr. Anders Vilhelm                           1
Sivic, Mr. Husein                                        1
Hoyt, Mr. Frederick Maxfield                             1
Davis, Miss. Mary                                        1
Pernot, Mr. Rene                                         1
Eklund, Mr. Hans Linus                                   1
Toufik, Mr. Nakli                                        1
Carter, Mr. William Ernest                               1
Dennis, Mr. Samuel                                       1
Palsson, Miss. Torborg Danira                            1
Flynn, Mr. John                                          1
Saundercock, Mr. William Henry                           1
Sandstrom, Miss. Marguerite Rut                          1
Frolicher, Miss. Hedwig Margaritha                       1
Mitkoff, Mr. Mito                                        1
Berglund, Mr. Karl Ivar Sven                             1
White, Mr. Richard Frasar                                1
O'Brien, Mr. Thomas                                      1
Lundahl, Mr. Johan Svensson                              1
Turja, Miss. Anna Sofia                                  1
Hodges, Mr. Henry Price                                  1
Bracken, Mr. James H                                     1
Ford, Mrs. Edward (Margaret Ann Watson)                  1
                                                        ..
Adahl, Mr. Mauritz Nils Martin                           1
Hunt, Mr. George Henry                                   1
Harris, Mr. George                                       1
Ostby, Mr. Engelhart Cornelius                           1
Carter, Master. William Thornton II                      1
Carter, Rev. Ernest Courtenay                            1
Daly, Mr. Peter Denis                                    1
Hogeboom, Mrs. John C (Anna Andrews)                     1
Nakid, Miss. Maria ("Mary")                              1
Hansen, Mr. Henrik Juul                                  1
Laroche, Mrs. Joseph (Juliette Marie Louise Lafargue)    1
Seward, Mr. Frederic Kimber                              1
Gustafsson, Mr. Alfred Ossian                            1
Allison, Master. Hudson Trevor                           1
Coleff, Mr. Peju                                         1
Johansson, Mr. Gustaf Joel                               1
de Mulder, Mr. Theodore                                  1
Skoog, Master. Harald                                    1
Zabour, Miss. Thamine                                    1
Burns, Miss. Elizabeth Margaret                          1
Knight, Mr. Robert J                                     1
Danbom, Mr. Ernst Gilbert                                1
Sedgwick, Mr. Charles Frederick Waddington               1
Sinkkonen, Miss. Anna                                    1
Harris, Mrs. Henry Birkhardt (Irene Wallach)             1
Glynn, Miss. Mary Agatha                                 1
Guggenheim, Mr. Benjamin                                 1
Klasen, Mr. Klas Albin                                   1
Jussila, Miss. Katriina                                  1
Leinonen, Mr. Antti Gustaf                               1
Name: Name, Length: 891, dtype: int64

male      577
female    314
Name: Sex, dtype: int64

347082               7
1601                 7
CA. 2343             7
3101295              6
347088               6
CA 2144              6
S.O.C. 14879         5
382652               5
17421                4
LINE                 4
113781               4
19950                4
PC 17757             4
349909               4
W./C. 6608           4
347077               4
4133                 4
2666                 4
113760               4
PC 17755             3
C.A. 34651           3
C.A. 31921           3
371110               3
PC 17582             3
248727               3
F.C.C. 13529         3
29106                3
PC 17760             3
110152               3
363291               3
                    ..
C.A. 24580           1
33638                1
370372               1
A./5. 2152           1
236853               1
2674                 1
STON/O 2. 3101280    1
350052               1
5727                 1
695                  1
PC 17605             1
350048               1
14973                1
PC 17759             1
2669                 1
341826               1
315089               1
349246               1
A/5 21171            1
29011                1
345777               1
2641                 1
244278               1
S.O.P. 1166          1
347069               1
236852               1
349256               1
349221               1
27267                1
347466               1
Name: Ticket, Length: 681, dtype: int64

B96 B98            4
C23 C25 C27        4
G6                 4
F2                 3
C22 C26            3
D                  3
E101               3
F33                3
E24                2
C52                2
E33                2
B28                2
C126               2
F4                 2
B51 B53 B55        2
E8                 2
E25                2
B57 B59 B63 B66    2
E121               2
B5                 2
D20                2
C78                2
E44                2
D17                2
C83                2
B58 B60            2
D26                2
B77                2
D36                2
C2                 2
                  ..
C148               1
A19                1
E58                1
C70                1
B102               1
C103               1
E68                1
C62 C64            1
A32                1
E17                1
C50                1
B79                1
B38                1
D56                1
D30                1
B42                1
D21                1
C99                1
B39                1
E31                1
D11                1
E36                1
B101               1
A23                1
A36                1
C111               1
B73                1
B50                1
D47                1
E77                1
Name: Cabin, Length: 147, dtype: int64

S    644
C    168
Q     77
Name: Embarked, dtype: int64

### In a new python module, `acquire.py`:

1. **`get_titanic_data`:** returns the titanic data from the Codeup data science database as a pandas data frame.

2. **`get_iris_data`:** returns the data from the `iris_db` on the Codeup data science database as a pandas data frame. The returned data frame should include the actual name of the species in addition to the species_ids.

In [24]:
sql='''select measurements.*, species.species_name from measurements join species using (species_id)'''

In [25]:
db_url = acq.sql_df(sql, 'iris_db', splain=1)

starting sql_df
starting get_db_url
ending get_db_url ; time: 4.76837158203125e-06
starting df_df
DATAFRAME SHAPE:
(150, 7)

DATAFRAME INFO:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 7 columns):
measurement_id    150 non-null int64
sepal_length      150 non-null float64
sepal_width       150 non-null float64
petal_length      150 non-null float64
petal_width       150 non-null float64
species_id        150 non-null int64
species_name      150 non-null object
dtypes: float64(4), int64(2), object(1)
memory usage: 8.3+ KB
None

DATAFRAME DESCRIPTION:
                count       mean        std  min    25%    50%     75%    max
measurement_id  150.0  75.500000  43.445368  1.0  38.25  75.50  112.75  150.0
sepal_length    150.0   5.843333   0.828066  4.3   5.10   5.80    6.40    7.9
sepal_width     150.0   3.057333   0.435866  2.0   2.80   3.00    3.30    4.4
petal_length    150.0   3.758000   1.765298  1.0   1.60   4.35    5.10    6.9
petal_width     150.0   1.199333   0.762238  0.1   0.30   1.30    1.80    2.5
species_id      150.0   2.000000   0.819232  1.0   1.00   2.00    3.00    3.0

DATAFRAME HEAD:
   measurement_id  sepal_length  sepal_width  petal_length  petal_width  \
0               1           5.1          3.5           1.4          0.2
1               2           4.9          3.0           1.4          0.2
2               3           4.7          3.2           1.3          0.2
3               4           4.6          3.1           1.5          0.2
4               5           5.0          3.6           1.4          0.2

   species_id species_name
0           1       setosa
1           1       setosa
2           1       setosa
3           1       setosa
4           1       setosa

ending df_df ; time: 0.02843022346496582
ending sql_df ; time: 1.3945517539978027

# Exercises - Data Preparation

**The end product of this exercise should be the specified functions in a python script named** 
`prepare.py`
**. Do these in your classification_exercises.ipynb first, then transfer to the** 
`prepare.py` 
**file.**

### 1. Iris Data

   a. Use the function defined in `acquire.py` to load the iris data.

   b. Drop the `species_id` and `measurement_id` columns.

   c. Rename the `species_name` column to just `species`.

   d. Encode the species name using a sklearn label encoder. Research the `inverse_transform` method of the label encoder. How might this be useful?

   e. Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.

### 2. Titanic Data

a. Use the function you defined in `acquire.py` to load the titanic data set.

In [28]:
df = acq.get_titanic_data(splain=True)

starting get_titanic_data
starting sql_df
starting get_db_url
ending get_db_url ; time: 4.0531158447265625e-06
starting df_df
DATAFRAME SHAPE:
(891, 13)

DATAFRAME INFO:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
passenger_id    891 non-null int64
survived        891 non-null int64
pclass          891 non-null int64
sex             891 non-null object
age             714 non-null float64
sibsp           891 non-null int64
parch           891 non-null int64
fare            891 non-null float64
embarked        889 non-null object
class           891 non-null object
deck            203 non-null object
embark_town     889 non-null object
alone           891 non-null int64
dtypes: float64(2), int64(6), object(5)
memory usage: 90.6+ KB
None

DATAFRAME DESCRIPTION:
              count        mean         std   min       25%       50%    75%  \
passenger_id  891.0  445.000000  257.353842  0.00  222.5000  445.0000  667.5
survived      891.0    0.383838    0.486592  0.00    0.0000    0.0000    1.0
pclass        891.0    2.308642    0.836071  1.00    2.0000    3.0000    3.0
age           714.0   29.699118   14.526497  0.42   20.1250   28.0000   38.0
sibsp         891.0    0.523008    1.102743  0.00    0.0000    0.0000    1.0
parch         891.0    0.381594    0.806057  0.00    0.0000    0.0000    0.0
fare          891.0   32.204208   49.693429  0.00    7.9104   14.4542   31.0
alone         891.0    0.602694    0.489615  0.00    0.0000    1.0000    1.0

                   max
passenger_id  890.0000
survived        1.0000
pclass          3.0000
age            80.0000
sibsp           8.0000
parch           6.0000
fare          512.3292
alone           1.0000

ending df_df ; time: 0.025818824768066406
ending sql_df ; time: 1.388659954071045
ending get_titanic_data ; time: 1.3887403011322021

b. Handle the missing values in the `embark_town` and `embarked` columns.

c. Remove the `deck` column.

d. Use a label encoder to transform the `embarked` column.

e. Scale the `age` and `fare` columns using a min max scaler. Why might this be beneficial? When might you not want to do this?

f. Create a function named prep_titanic that accepts the untransformed titanic data, and returns the data with the transformations above applied.